{
	"StrukturDirektoriLinux": [
		"<><P>Struktur direktori linux sangat berbeda dengan Windows maupun MS-DOS. Dalam sistem operasi linux termasuk Debian, struktur direktorinya menggunakan konsep hierarki. Dengan direktori root sebagai dasar dari seluruh direktori yang ada di linux.</P><P></P><P>Berikut adalah gambaran dari struktur direktori linux pada umumnya.</P><P></P><Img src={struktur}/><C1>Sumber: www.belajarpc.com</C1><P></P><P>Berikut adalah fungsi dari masing-masing struktur direktori linux.</P><H2>1. / - Root</H2><P>Direktori / merupakan direktori utama dari seluruh direktori yang ada di linux.</P><H2>2. /bin - User Binaries</H2><P>Direktori /bin berisi file-file eksekusi atau file binari yang digunakan oleh sistem.</P><P>Contoh: cp, mv, ping</P></>",
		"<><H2>3. /boot - Boot Loader Files</H2><P>Direktori /boot berisi file untuk kebutuhan booting sistem operasi yang berhubungan dengan boot loader.</P><H2>4. /dev - Device Files</H2><P>Direktori /dev berisi file device pada komputer seperti Harddisk, CD-ROM, dan lain-lain.</P><P>Contoh: sda1, fd0, cdrom</P><H2>5. /etc - Configuration Files</H2><P>Direktori /etc berisi file-file konfigurasi yang dibutuhkan oleh semua program.</P><P>Contoh: /etc/resolv.conf, /etc/hostname</P><H2>6. /home - Home Directories</H2><P>Direktori /home berisi file pribadi semua user.</P><P>Contoh: /home/bukusakutkj</P><H2>7. /lib - System Libraries</H2><P>Direktori /lib berisi file-file libary dan file yang berhubungan dengan kernel.</P></>",
		"<><H2>8. /media - Removable Media Devices</H2><P>Direktori /media merupakan direktori tempat sementara untuk removable devices.</P><P>Contoh: /media/cdrom</P><H2>9. /mnt - Mount Directory</H2><P>Direktori /mnt merupakan direktori sementara yang digunakan untuk me-mount filesystem atau file temporary.</P><H2>10. /opt - Optional add-on Applications</H2><P>Direktori /opt berisi file-file tambahan dari vendor tertentu.</P><H2>11. /sbin - System Binaries</H2><P>Direktori /sbin sama seperti direktori /bin berisi file yang bisa dieksekusi oleh administrator sistem dengan tujuan untuk pemeliharaan sistem.</P><P>Contoh: ifconfig, fdisk, reboot</P><H2>12. /srv - Service Data</H2><P>Direktori /srv berisi file-file service yang dibutuhkan oleh server.</P><P>Contoh : /srv/www, /srv/ftp</P></>",
		"<><H2>13. /tmp - Temporary Files</H2><P>Direktori /tmp berisi file-file temporary (sementara) yang digunakan selama sistem operasi berjalan dan akan dihapus ketika sistem operasi reboot.</P><H2>14. /usr - User Programs</H2><P>Direktori /usr berisi file-file binari, libraries, dokumentasi, dan source code dari sistem. Direktori ini juga bisa digunakan oleh seluruh user untuk berbagai kepentingan seperti sharing folder.</P><H2>15. /var - Variable Files</H2><P>Direktori /var berisi file-file variable seperti log sistem. email, file print, dan lain-lain.</P><H2>16. /proc - Process Information</H2><P>Direktori /proc berisi informasi tentang proses yang sedang dijalankan sistem operasi.</P><P><N1/><B>Referensi:</B></P><C1>1. http://www.belajarpc.com/sistem-operasi/linux/mengenal-struktur-direktori-pada-linux.html</C1><C1>2. Ebook Administrasi Server Jaringan dengan Debian Wheezy - Ahmad Rosid Komarudin</C1></>"
	],

	"PerintahDasarLinux": [
		"<><P>Terdapat banyak sekali perintah dasar pada linux yang bisa kita pelajari untuk memudahkan pekerjaan kita ketika menggunakan sistem operasi linux. Tetapi, dalam materi ini hanya akan dijelaskan beberapa perintah saja yang mungkin seringkali digunakan.</P><P></P><P>Berikut adalah beberapa perintah dasar yang seringkali digunakan:</P><H2>1. pwd</H2><P>Perintah untuk menunjukkan lokasi direktori yang aktif. Contoh di atas menampilkan direktori yang aktif berada di /root.</P><Code>root@bukusakutkj:~# pwd <N1/>/root</Code></>",
		"<><H2>2. cd</H2><P>Perintah untuk berpindah dari direktori aktif ke direktori lainnya. Contoh berikut berpindah dari direktori aktif yaitu direktori /root ke direktori /home.</P><Code>root@bukusakutkj:~# cd /home <N1/>root@bukusakutkj:/home#</Code><H2>3. ls</H2><P>Perintah untuk melihat isi dari sebuah direktori. Contoh berikut menampilkan isi dari direktori /home.</P><Code>root@bukusakutkj:/home# ls <N1/>user1</Code></>",
		"<><H2>4. mkdir</H2><P>Perintah untuk membuat sebuah direktori. Contoh berikut membuat direktori /bukusakutkj di dalam direktori /home.</P><Code>root@bukusakutkj:/home# cd <N1/>root@bukusakutkj:~# mkdir /home/bukusakutkj <N1/>root@bukusakutkj:~# ls /home <N1/>bukusakutkj 	user1</Code><H2>5. rmdir</H2><P>Perintah untuk menghapus sebuah direktori. Contoh berikut menghapus direktori /bukusakutkj yang berada pada direktori /home.</P><Code>root@bukusakutkj:~# rmdir /home/bukusakutkj/ <N1/>root@bukusakutkj:~# ls /home <N1/>user1</Code></>",
		"<><H2>6. touch</H2><P>Perintah untuk membuat sebuah file. Contoh berikut membuat sebuah file bukusakutkj.txt di dalam direktori /home.</P><Code>root@bukusakutkj:~# cd /home <N1/>root@bukusakutkj:/home# touch bukusakutkj.txt <N1/>root@bukusakutkj:/home# ls <N1/>bukusakutkj.txt user1</Code><H2>7. rm</H2><P>Perintah untuk menghapus sebuah file. Contoh berikut menghapus sebuah file bukusakutkj.txt yang berada pada direktori /home.</P><Code>root@bukusakutkj:/home# ls <N1/>bukusakutkj.txt user1 <N1/>root@bukusakutkj:/home# rm bukusakutkj.txt <N1/>root@bukusakutkj:/home# ls <N1/>user1</Code></>",
		"<><H2>8. cp</H2><P>Perintah untuk mengcopy file atau folder. Contoh berikut mengcopy file bukumu.txt pada direktori kamu ke direktori saya.</P><Code>root@bukusakutkj:/home# mkdir saya kamu <N1/>root@bukusakutkj:/home# ls <N1/>kamu saya user1 <N1/>root@bukusakutkj:/home# touch kamu/bukumu.txt <N1/>root@bukusakutkj:/home# cp kamu/bukumu.txt saya/ <N1/>root@bukusakutkj:/home# ls saya/ <N1/>bukumu.txt</Code><P></P><P>Dan contoh berikut mengcopy direktori saya beserta isinya ke direktori kamu. Perintah -rf dibelakangnya harus ikut disertakan jika ingin mengcopy direktori.</P><Code>root@bukusakutkj:/home# cp saya/ kamu/ -rf <N1/>root@bukusakutkj:/home# ls kamu/ <N1/>bukumu.txt saya <N1/>root@bukusakutkj:/home# ls kamu/saya/ <N1/>bukumu.txt</Code></>",
		"<><H2>9. mv</H2><P>Perintah untuk memindahkan sebuah file atau direktori. Berikut contoh memindahkan file bukumu.txt pada direktori saya dipindahkan ke direktori /home.</P><Code>root@bukusakutkj:/home# ls <N1/>kamu saya user1 <N1/>root@bukusakutkj:/home# cd saya/ <N1/>root@bukusakutkj:/home/saya# ls <N1/>bukumu.txt <N1/>root@bukusakutkj:/home/saya# mv bukumu.txt /home <N1/>root@bukusakutkj:/home/saya# ls /home/ <N1/>bukumu.txt kamu saya user1</Code><H2>10. man</H2><P>Perintah untuk menampilkan manual atau bantuan dari suatu perintah. Berikut contoh menampilkan manual dari mv.</P><Code>root@bukusakutkj:~# man mv</Code><Img src={perintah}/></>",
		"<><H2>11. cat</H2><P>Perintah untuk menampilkan isi dari suatu file. Berikut contoh menampilkan isi dari file interfaces yang ada pada direktori /etc/network.</P><Code>root@bukusakutkj:/home# cat /etc/network/interfaces<N1/><N1/># This file describes the network interfaces available on your system <N1/># and how to activate them. For more information, see interfaces(5). <N1/>source /etc/network/interfaces.d/* <N1/><N1/># The loopback network interface <N1/>auto lo <N1/>iface lo inet loopback <N1/><N1/># The primary network interface <N1/>allow-hotplug enp0s3 <N1/>iface enp0s3 inet dhcp</Code></>",
		"<><H2>12. grep</H2><P>Perintah untuk mencari karakter, kata, atau kalimat tertentu dengan suatu kata kunci. Berikut contoh mencari kata yang ada pada file dan direktori /etc/network/interfaces.</P><Code>root@bukusakutkj:~# cat /etc/network/interfaces | grep dhcp <N1/>#iface enp0s3 inet dhcp <N1/>root@bukusakutkj:~# cat /etc/network/interfaces | grep lo <N1/># The loopback network interface <N1/>auto lo <N1/>iface lo inet loopback <N1/>#allow-hotplug enp0s3</Code><P></P><B>Referensi:</B><C1>Ebook Administrasi Server Jaringan dengan Debian Wheezy - Ahmad Rosid Komarudin</C1></>"
	],

	"ManajemenUser&GroupLinux": [
		"<><P>Sistem operasi linux merupakan sitem operasi multiuser. Dikatakan multiuser karena bisa menangani lebih dari satu user dalam waktu bersamaan.</P><P></P><P>Secara garis besar, dalam sistem operasi linux user dibagi menjadi 2 jenis yaitu user root dan user biasa. Dimana user root memiliki simbol (#) dan user biasa dengan simbol ($). Keduanya memiliki perbedaan dalam hak akses. User root bisa melakukan apa saja dalam sistem operasi sedangkan user biasa biasanya hanya bisa melakukan modifikasi file atau direktori home miliknya saja.</P><P></P><P>Fungsi dari group di linux adalah untuk memudahkan pemberian hak akses ke sejumlah user. Dengan adanya group maka ketika kita memiliki 5 user dan kita ingin memberikan hak akses yang sama kepada 5 user tersebut. Tentunya akan sangat merepotkan jika kita harus memberikan hak akses kepada masing-masing user satu per satu.</P></>",
		"<><P>Berikut adalah beberapa perintah dasar untuk melakukan manajemen user dan group.</P><H2>1. useradd</H2><Code>root@bukusakutkj:~# useradd siswa1 <N1/>root@bukusakutkj:~# passwd siswa1 <N1/>New password: <N1/>Retype new password: <N1/>passwd: password updated successfully</Code><P>Perintah useradd di atas digunakan untuk membuat user dengan nama siswa1. Kemudian diikuti perintah passwd untuk memberikan password pada user siswa1.</P></>",
		"<><H2>2. adduser</H2><Code>root@bukusakutkj:~# adduser siswa2 <N1/>Adding user `siswa2' ... <N1/>Adding new group `siswa2' (1003) ... <N1/>Adding new user `siswa2' (1003) with group `siswa2' ... <N1/>Creating home directory `/home/siswa2' ... <N1/>Copying files from `/etc/skel' ... <N1/>New password: <N1/>Retype new password: <N1/>passwd: password updated successfully <N1/>Changing the user information for siswa2 <N1/>Enter the new value, or press ENTER for the default <N1/> Full Name []: Siswa 2 <N1/> Room Number []: <N1/> Work Phone []: <N1/> Home Phone []: 12345 <N1/> Other []: <N1/>Is the information correct? [Y/n] y <N1/>root@bukusakutkj:~# ls /home <N1/>siswa2 user1</Code><P>Perintah adduser juga digunakan untuk membuat sebuah user seperti useradd perbedaannya adalah adduser akan meminta detail user yang dibuat dan dibuatkan sebuah home direktori di /home/namauser.</P></>",
		"<><H2>3. su</H2><Code>root@bukusakutkj:~# su siswa2 <N1/>siswa2@bukusakutkj:/root$ su <N1/>Password: <N1/>root@bukusakutkj:~#</Code><P>Perintah su digunakan untuk login ke user lain. Perhatikan tampilan di atas menunjukkan perintah untuk login ke user siswa2 yang merupakan user biasa sehingga tandanya berubah menjadi ($) setelah login user siswa2. Kemudian menggunakan perintah su saja tanpa namauser untuk login ke user root maka tandanya akan berubah menjadi (#).</P></>",
		"<><H2>4. userdel</H2><Code>root@bukusakutkj:~# userdel siswa2 -rf <N1/>userdel: user siswa2 is currently used by process 607 <N1/>userdel: siswa2 mail spool (/var/mail/siswa2) not found <N1/>root@bukusakutkj:~# su siswa2 <N1/>su: user siswa2 does not exist <N1/>root@bukusakutkj:~# ls /home/ <N1/>user1</Code><P>Perintah userdel di atas digunakan untuk menghapus user siswa2 dan perintah opsi setelahnya -rf berfungsi untuk menghapus user siswa2 meskipun masih dalam keadaan login. (-f) artinya force (hapus paksa) dan (-r) artinya hapus home direktori user siswa2.</P><H2>5. groupadd</H2><Code>root@bukusakutkj:~# groupadd sakutkj</Code><P>Perintah groupadd di atas digunakan untuk membuat sebuah group dengan nama sakutkj.</P></>",
		"<><H2>6. groupdel</H2><Code>root@bukusakutkj:~# groupdel sakutkj</Code><P>Perintah groupdel di atas digunakan untuk menghapus sebuah group dengan nama sakutkj.</P><H2>7. groups</H2><Code>root@bukusakutkj:~# groups siswa1 <N1/>siswa1 : siswa1</Code><P>Perintah groups di atas digunakan untuk melihat keanggotaan user siswa1 terhadap group.</P></>",
		"<><H2>8. adduser & groups</H2><Code>root@bukusakutkj:~# adduser siswa1 sakutkj <N1/>Adding user `siswa1' to group `sakutkj' ... <N1/>Adding user siswa1 to group sakutkj <N1/>Done. <N1/>root@bukusakutkj:~# groups siswa1 <N1/>siswa1 : siswa1 sakutkj</Code><P>Perintah adduser di atas akan memasukkan user siswa1 yang sudah kita buat ke group sakutkj. Bisa dilihat di atas bahwa siswa1 merupakan anggota dari group siswa1 (dirinya sendiri) dan grup sakutkj.</P><P></P><B>Referensi:</B><C1>Ebook Administrasi Server Jaringan dengan Debian Wheezy - Ahmad Rosid Komarudin</C1></>"
	],

	"TextEditorLinux": [
		"<><P>Untuk melakukan modifikasi pada suatu file kita membutuhkan suatu text editor layaknya sistem operasi windows menggunakan notepad misalnya. Sama halnya dengan linux, ada beberapa jenis text editor diantaranya vi, vim, pico, nano, dan lainnya. Tetapi pada seri Debian ini text editor yang akan digunakan adalah nano.</P><P></P><P>Contoh penggunaan nano sebagai berikut.</P><Code>root@bukusakutkj:~# nano /etc/network/interfaces</Code><P>Dalam penggunaan text editor nano akan lebih mudah jika mengerti shortcuts-nya agar lebih cepat dalam melakukan modifikasi file dan sebagainya.</P><P></P><P>Berikut adalah shortcuts penggunaan text editor nano.</P><Img src={editor}/></>"
	],

  	"KonfigurasiIPAddress": [
		"<><P>Dalam suatu jaringan agar suatu komputer dapat terkoneksi ke internet maka harus memiliki alamat IP Address. </P><P></P><P>Berikut ini adalah bagaimana cara konfigurasi IP Address pada Debian.</P><H2>1. Gunakan User root</H2><P>Sebelum melakukan konfigurasi IP Address pastikan kalian telah login menggunakan user root.</P><Code>siswa2@bukusakutkj:/$ su <N1/>Password: <N1/>root@bukusakutkj:/#</Code></>",
		"<><H2>2. Cek IP Address</H2><P>Gunakan perintah ip addr untuk melihat IP Address dan network interface yang terpasang pada komputer kita.</P><P></P><Img src={ip1}/><P></P><P>Pada gambar di atas setelah menggunakan perintah ip addr muncul network interface dan ip address-nya terlihat pada poin No. 2 dengan nama network interface-nya enp0s3 (perlu diperhatikan untuk penamaan network interface biasanya berbeda-beda contohnya seperti eth0, eth1, dan sebagainya). Dan terlihat pada interface enp0s3 belum memiliki IP Address.</P></>",
		"<><H2>3. Konfigurasi IP Static</H2><Code>root@bukusakutkj:~# nano /etc/network/interfaces</Code><P>Perintah di atas akan membuka file konfigurasi interfaces dan IP Address seperti tampilan berikut ini.</P><Code># This file describes the network interfaces available on <N1/>your system <N1/># and how to activate them. For more information, see interfaces(5). <N1/><N1/>source /etc/network/interfaces.d/* <N1/><N1/># The loopback network interface <N1/>auto lo <N1/>iface lo inet loopback <N1/><N1/># The primary network interface <N1/>allow-hotplug enp0s3 <N1/>iface enp0s3 inet dhcp</Code><P>Pada tampilan di atas bagian interface enp0s3 terlihat bahwa interface tersebut terkonfigurasi sebagai dhcp client.</P></>",
		"<><P>Ubahlah pada bagian interface yang akan kita konfigurasi contoh disini interface enp0s3 untuk konfigurasi IP secara static atau manual.</P><Code># The primary network interface <N1/>auto enp0s3 <N1/>iface enp0s3 inet static <N1/> address 192.168.1.1/24</Code><P>Pada tampilan di atas kita memberikan komputer kita dengan IP Address 192.168.1.1 dengan netmask 255.255.255.0 atau /24.</P><H2>4. Restart Service Network</H2><P>Agar hasil konfigurasi IP berjalan perlu di restart terlebih dahulu.</P><Code>root@bukusakutkj:~# service networking restart</Code><Img src={ip2}/><P></P><P>Bisa dilihat pada gambar di atas bahwa konfigurasi IP Address telah berhasil. Anda bisa melakukan pengujian dengan menggunakan ping.</P></>"
  	],

  	"KonfigurasiHostname": [
		"<><P>Hostname merupakan nama sebuah perangkat dalam sebuah jaringan yang digunakan untuk membedakan perangkat satu dengan yang lainnya. Hostname dibuat ketika kita melakukan installasi sistem operasi. Jika kita ingin merubah hostname maka kita bisa mengkonfigurasinya. Berikut cara konfigurasi hostname pada Debian.</P><H2>1. Gunakan Akses User root</H2><P>Sebelum melakukan konfigurasi pastikan telah login dengan menggunakan user root.</P><H2>2. Konfigurasi Hostname</H2><Code>root@bukusakutkj:~# nano /etc/hostname<N1/>bukusakutkj</Code><P>Perintah di atas akan membuka file hostname berisi kata bukusakutkj. Kita bisa merubah hostname dengan cara menghapus kata bukusakutkj dengan nama hostname baru kita misal sakutkj.</P><Code>sakutkj</Code></>",
		"<><P>Lalu lanjut konfigurasi file hosts dengan perintah berikut.</P><Code>root@bukusakutkj:~# nano /etc/hosts <N1/><N1/>127.0.0.1 localhost <N1/>127.0.1.1 bukusakutkj.bukusakutkj.me.id bukusakutkj <N1/><N1/># The following lines are desirable for IPv6 capable hosts <N1/>::1 localhost ip6-localhost ip6-loopback <N1/>ff02::1 ip6-allnodes <N1/>ff02::2 ip6-allrouters</Code><P>Pada tampilan di atas ubah pada baris kedua saja. Hasilnya seperti berikut ini.</P><Code>127.0.0.1 localhost <N1/>127.0.1.1 sakutkj.sakutkj.me.id sakutkj</Code><H2>3. Reboot</H2><P>Restart komputer anda untuk melihat hasil konfigurasi hostname.</P></>"
	],

	"KonfigurasiRepository": [
		"<><P>Ketika kita ingin menginstall sebuah aplikasi tentunya kita membutuhkan file installer dari aplikasi yang akan kita install yang biasanya berekstensi .exe. Pada sistem operasi linux juga demikian, dengan menggunakan sebuah repository yang merupakan sebuah alamat yang menunjukkan lokasi penyimpanan file-file installer saat kita akan menginstall sebuah aplikasi.</P><P></P><P>Repository pada linux perlu dikonfigurasi agar ketika kita akan melakukan installasi sebuah aplikasi maka sistem operasi akan membaca file konfigurasi repository dan kemudian langsung mengakses lokasi repository yang ditujukan pada konfigurasi repository.</P><P></P><P>Berikut cara konfigurasi repository pada Debian.</P><H2>1. Menggunakan DVD</H2><P>Untuk menggunakan cara ini diperlukan file iso Debian binary 1 sampai 3 yang bisa di download melalui situs www.debian.org.</P><Code>root@sakutkj:/# nano /etc/apt/sources.list</Code></>",
		"<><P>Pertama kita perlu memberi tanda # atau comment pada file /etc/apt/source.list seperti gambar berikut.</P><P></P><Img src={repo0}/><P></P><P>Selanjutnya masukkan DVD Debian Binary 1 kemudian ketikan perintah berikut.</P><P></P><Img src={repo1}/><P></P><P>Selanjutnya masukkan DVD Debian Binary 2 dan 3 kemudian ketikan perintah di atas. Lalu jika sudah semua kita bisa langsung menginstall aplikasi-aplikasi yang dibutuhkan menggunakan perintah apt-install nama-paket.</P></>",
		"<><H2>2. Menggunakan repository online</H2><P>Disini dicontohkan konfigurasi repository Debian 10. Untuk menggunakan repository online kita butuh koneksi internet dan list repository lokal.</P><P></P><P>Berikut list repository lokal Debian 10.</P><P></P><P>Repository Default Debian 10</P><Code>deb http://deb.debian.org/debian buster main contrib</Code><P>Kambing - UI</P><Code>deb http://kambing.ui.ac.id/debian/ buster main contrib non-free <N1/>deb http://kambing.ui.ac.id/debian-security/ buster/updates main contrib non-free</Code></>",
		"<><P>Repo - UGM</P><Code>deb http://repo.ugm.ac.id/debian/ buster main contrib non-free <N1/>deb http://repo.ugm.ac.id/debian-security/ buster/updates main contrib non-free</Code><P>Kartolo - Datautama</P><Code>deb http://kartolo.sby.datautama.net.id/debian/ buster main contrib non-free <N1/>deb http://kartolo.sby.datautama.net.id/debian-security/ buster/updates main contrib non-free</Code><P>Mirror - UNEJ</P><Code>deb http://mirror.unej.ac.id/debian/ buster main contrib non-free <N1/>deb http://mirror.unej.ac.id/debian-security/ buster/updates main contrib non-free</Code></>",
		"<><P>Mirror - LABKOM</P><Code>deb http://mirror.labkom.id/debian/ buster main contrib non-free <N1/>deb http://mirror.labkom.id/debian-security/ buster/updates main contrib non-free</Code><P>Suro - UBAYA</P><Code>deb http://suro.ubaya.ac.id/debian/ buster main contrib non-free <N1/>deb http://suro.ubaya.ac.id/debian-security/ buster/updates main contrib non-free</Code><P>Lalu cara konfigurasinya sangat mudah kita tinggal memasukkan salah satu list repository di atas pada file /etc/apt/source.list seperti berikut ini.</P><Code>root@sakutkj:/# nano /etc/apt/sources.list</Code></>",
		"<><P>Berikan tanda (#) atau comment pada baris perintah yang tidak dibutuhkan. Lalu tambahkan list repository, contoh berikut menggunakan list repo Kambing UI.</P><P></P><Img src={repo2}/><P></P><P>Selanjutnya, pastikan komputer server terkoneksi dengan internet, kemudian ketikan perintah berikut.</P><Code>root@sakutkj:~# apt-get update</Code><P>Lalu jika sudah kita bisa langsung menginstall aplikasi-aplikasi yang dibutuhkan menggunakan perintah apt-install nama-paket tanpa menggunakan DVD seperti cara ke-1 tapi menggunakan koneksi internet.</P><P></P><B>Referensi:</B><C1>https://zonabiner.com/tutorial/debian/cara-konfigurasi-repository-pada-debian-10-untuk-instalasi-paket</C1></>"
	],

	"KonfigurasiRemoteAccessSSH":[
		"<><P>Dengan menggunakan Remote Access kita bisa meremote komputer dari jauh tanpa harus berada di depan komputer. SSH memiliki tingkat keamanan yang jauh lebih tinggi daripada telnet.</P><P></P><P>Berikut cara konfigurasi SSH di Debian.</P><H2>1. Konfigurasi IP Address</H2><P>Pastikan komputer server sudah dikonfigurasi IP Address untuk keperluan pengujian nantinya.</P><H2>2. Install Paket openssh-server</H2><P>Jalankan perintah berikut untuk menginstall paket aplikasi openssh-server. </P><Code>root@sakutkj:/# apt-get install openssh-server</Code></>",
		"<><H2>3. Pengujian</H2><P>Pengujian bisa kita lakukan melalui komputer kita sendiri atau menggunakan client melalui cmd jika di windows atau aplikasi putty. Contoh berikut menggunakan komputer Debian kita sendiri.</P><Code>root@sakutkj:/# ssh 192.168.1.1 -l siswa2 <N1/>siswa2@192.168.1.1's password: <N1/>Linux sakutkj 4.19.0-11-amd64 #1 SMP Debian 4.19.146-1 (2020-09-17) x86_64 <N1/><N1/>The programs included with the Debian GNU/Linux system are free software; the exact distribution terms for each program are described in the individual files in /usr/share/doc/*/copyright. <N1/><N1/>Debian GNU/Linux comes with ABSOLUTELY NO WARRANTY, to the extent permitted by applicable law. <N1/>Last login: Thu May 27 23:50:18 2021 from 192.168.1.2 <N1/>siswa2@sakutkj:~$</Code><P>Perintah di atas digunakan untuk meremote server dengan alamat IP Address 192.168.1.1 menggunakan opsi (-l) untuk user yang digunakan yaitu siswa2.</P></>"
	],

	"KonfigurasiRemoteAccessTelnet": [
		"<><P>Dengan menggunakan Remote kita bisa meremote komputer dari jauh tanpa harus berada di depan komputer.</P><P></P><P>Berikut cara konfigurasi Telnet di Debian.</P><H2>1. Konfigurasi IP Address</H2><P>Pastikan komputer server sudah dikonfigurasi IP Address untuk keperluan pengujian nantinya.</P><H2>2. Install Paket telnetd</H2><P>Jalankan perintah berikut untuk menginstall paket aplikasi telnetd. </P><Code>root@sakutkj:/# apt-get install openssh-server</Code><H2>3. Pengujian</H2><P>Pengujian bisa kita lakukan melalui komputer kita sendiri atau menggunakan client melalui cmd jika di windows atau aplikasi putty. Contoh berikut menggunakan server Debian kita sendiri.</P></>",
		"<><Code>root@sakutkj:/# telnet 192.168.1.1 <N1/>Trying 192.168.1.1... <N1/>Connected to 192.168.1.1. <N1/>Escape character is '^]'. <N1/>Debian GNU/Linux 10 <N1/>sakutkj login: siswa2 <N1/>Password: (tidak terlihat) <N1/>Last login: Sat May 29 19:26:33 WIB 2021 from 192.168.1.3 on pts/0 <N1/>Linux sakutkj 4.19.0-11-amd #1 SMP Debian 4.19.146-1 (2020-09-17) x86_64 <N1/><N1/>The programs included with the Debian GNU/Linux system are free software; the exact distribution terms for each program are described in the individual files in /usr/share/doc/*/copyright. <N1/><N1/>Debian GNU/Linux comes with ABSOLUTELY NO WARRANTY, to the extent permitted by applicable law. <N1/>siswa2@sakutkj:~$</Code><P>Perintah di atas digunakan untuk meremote server menggunakan telnet dengan alamat IP Address 192.168.1.1. Kemudian login menggunakan user siswa2.</P></>"
	],

	"KonfigurasiDNSServer": [
		"<><P>Domain Name System (DNS) adalah sebuah protokol jaringan komputer yang berfungsi untuk melakukan konversi IP Address menjadi domain atau sebaliknya.</P><P></P><P>Domain yang akan digunakan dalam contoh ini adalah sakutkj.me.id.</P><P></P><P>Berikut cara konfigurasi DNS Server pada Debian:</P><H2>1. Install Paket bind9</H2><Code>root@sakutkj:~# apt-get install bind9</Code><H2>2. Konfigurasi Domain Zone</H2><Code>root@sakutkj:~# cd /etc/bind <N1/>root@sakutkj:/etc/bind# nano named.conf</Code><Img src={dns1}/></>",
		"<><H2>Penjelasan:</H2><P></P><P><B>1. zone ''sakutkj.me.id''</B> = membuat domain dengan nama sakutkj.me.id</P><P><B>2. type master </B>= domain yang dibuat adalah primary dns server</P><P><B>3. file ''/etc/bind/db.sakutkj''</B> = lokasi penyimpanan file kofnigurasi domain forward (konversi domain menjadi IP Address)</P><P><B>4. zone ''192.in-addr.arpa''</B> = mendeskripsikan domain reverse yang kita buat</P><P><B>5. file ''/etc/bind/db.192''</B> = lokasi penyimpanan file kofnigurasi domain reverse (konversi IP Address menjadi Domain Name)</P><H2>3. Konfigurasi Domain Forward</H2><P>Buat file db.sakutkj dengan meng-copy db.local lalu modifikasi file db.sakutkj.</P><Code>root@sakutkj:/etc/bind# cp db.local db.sakutkj <N1/>root@sakutkj:/etc/bind# nano db.sakutkj</Code></>",
		"<><P>Lakukan modifikasi file db.sakutkj seperti berikut ini.</P><P></P><Img src={dns2}/><H2>4. Konfigurasi Domain Reverse</H2><P>Buat file db.192 dengan meng-copy db.127 lalu modifikasi file db.192.</P><Code>root@sakutkj:/etc/bind# cp db.127 db.192 <N1/>root@sakutkj:/etc/bind# nano db.192</Code><P>Lakukan modifikasi file db.192 seperti berikut ini.</P><P></P><Img src={dns3}/><P></P><P>Perhatikan pada gambar di atas pada bagian (1.1.168) merupakan kebalikan dari tiga oktek terakhir dari IP Address Server.</P><H2>5. Restart Service DNS</H2><Code>root@sakutkj:/etc/bind# service bind9 restart</Code></>",
		"<><H2>6. Pengujian</H2><P>Sebelum melakukan pengujian, pastikan resolver sudah diarahkan ke IP Address DNS Server.</P><Code>root@sakutkj:/etc/bind# nano /etc/resolv.conf <N1/>nameserver 192.168.1.1</Code><P>Pengujian akan menggunakan perintah nslookup seperti di bawah ini.</P><Code>root@sakutkj:/etc/bind# nslookup sakutkj.me.id <N1/>Server: 192.168.1.1 <N1/>Address: 192.168.1.1#53 <N1/><N1/>Name: sakutkj.me.id <N1/>Address: 192.168.1.1</Code><P>Jika tidak bisa menggunakan nslookup, anda perlu menginstall paket dnsutils terlebih dahulu menggunakan perintah berikut.</P><Code>root@sakutkj:/etc/bind# apt-get install dnsutils</Code></>",
		"<><P>Atau anda juga bisa menggunakan ping ke domain untuk melakukan pengujian.</P><Code>root@sakutkj:/etc/bind# ping sakutkj.me.id</Code></>"
	],

	"KonfigurasiWebServer": [
		"<><P>Web Server merupakan sebuah layanan untuk menampilkan sebuah halaman web kepada client dalam dunia internet. Contoh dari penerapan web server adalah situs-situs yang ada di internet contohnya www.shopee.co.id, www.tokopedia.com, dan sebagainya.</P><P></P><P>Berikut cara konfigurasi web server pada Debian.</P><H2>1. Konfigurasi IP Address & DNS Server</H2><P>Pastikan server telah dikonfigurasi IP Address dan DNS Server seperti bahasan-bahasan sebelumnya.</P><H2>2. Install Paket apache2 php7.3</H2><Code>root@sakutkj:~# apt-get install apache2 php7.3</Code><P>Perintah di atas akan menginstall aplikasi apache yang digunakan untuk membuat sebuah web server. Selain itu, perintah tersebut juga menginstall aplikasi tambahan yaitu php7.3 agar web server kita bisa support bahasa pemrograman PHP.</P></>",
		"<><H2>3. Konfigurasi Virtual Host</H2><P>Untuk membuat sebuah virtual host kita bisa meng-copy file contoh yang telah disediakan apache2 yang lokasinya berada di direktori /etc/apache2/sites-available.</P><Code>root@sakutkj:~# cd /etc/apache2/sites-available/ <N1/>root@sakutkj:/etc/apache2/sites-available# ls <N1/>000-default.conf default-ssl.conf <N1/>root@sakutkj:/etc/apache2/sites-available# cp 000-<N1/>default.conf www.conf <N1/>root@sakutkj:/etc/apache2/sites-available# nano www.conf</Code><P>Lalu tambahkan sedikit konfigurasi seperti gambar berikut.</P><P></P><Img src={web1}/></>",
		"<><H2>4. Edit Halaman index.html</H2><P>Masuk ke direktori /var/www/html kemudian buka file index.html dan mofifikasi.</P><Code>root@sakutkj:/etc/apache2/sites-available# mkdir /var/www/web <N1/>root@sakutkj:/etc/apache2/sites-available# nano /var/www/web/index.html</Code><P>Buat sebuah halaman HTML, contoh seperti berikut ini.</P><P></P><Img src={web2}/><H2>5. Aktifkan Konfigurasi Virtual Host</H2><Code>root@sakutkj:/etc/apache2/sites-available# a2ensite www.conf <N1/>Enabling site www. <N1/>To activate the new configuration, you need to run: <N1/> systemctl reload apache2</Code></>",
		"<><H2>6. Restart Service apache2</H2><Code>root@sakutkj:/etc/apache2/sites-available# service apache2 restart</Code><H2>7. Pengujian</H2><P>Lakukan pengujian pada client menggunakan browser dengan cara mengakses url web server kita. Pastikan komputer client terkoneksi dengan server kita. Berikut pengujian hasil dari konfigurasi yang telah kita lakukan.</P><P></P><Img src={web3}/></>"
	],

	"KonfigurasiFTPServer": [
		"<><P>File Transfer Protocol (FTP) adalah sebuah protokol yang digunakan untuk transfer file atau data melalui jaringan. Protokol ini seringkali digunakan untuk melakukan transfer file-file web ke web server.</P><P></P><P>Berikut cara konfigurasi FTP Server pada Debian.</P><H2>1. Install Paket proftpd</H2><Code>root@sakutkj:~# apt-get install proftpd</Code><P>Kita bisa langsung melakukan pengujian setelah menginstall paket di atas. Berikut pengujian pada client menggunakan Software Filezilla.</P><P></P><Img src={ftp1}/><P></P><P>Pada gambar di atas, bagian host anda bisa mengisikannya dengan IP Address atau domain dari server diikuti dengan username dan password serta port dari FTP yaitu port 21.</P></>",
		"<><H2>2. Konfigurasi Direktori FTP</H2><P>Pada contoh di atas sebelumnya, ketika user melakukan login maka otomatis akan diarahkan ke direktori user tersebut.</P><P></P><P>Pada contoh selanjutnya kita akan coba mengkonfigurasi agar ketika user login maka akan diarahkan ke direktori yang kita tentukan sebagai contoh direktori var/www/web atau direktori web server yang kita buat pada materi sebelumnya.</P><Code>root@sakutkj:~# nano /etc/proftpd/proftpd.conf</Code><P>Lalu tambahkan konfigurasi berikut ini pada bagian paling bawah.</P><Code># Include other custom configuration files <N1/>Include /etc/proftpd/conf.d/ <N1/>{'\<Anonymous /var/www/web\>'}<N1/> User siswa2 <N1/>{'\</Anonymous\>'}</Code></>",
		"<><P>Pada bagian User siswa2, kalian bisa menyesuaikan user mana yang akan diarahkan ke direktori /var/www/web ketika login menggunakan FTP.</P><H2>3. Pengujian</H2><P>Berikut pengujian pada client menggunakan Software Filezilla.</P><P></P><Img src={ftp2}/><P></P><P>Perhatikan pada garis merah gambar di atas. Disitu terdapat file index.html sama seperti yang ada pada direktori /var/www/web. Jadi, konfigurasi di atas telah berhasil.</P><P></P><P>Berikut adalah isi dari direktori /var/www/web pada server Debian.</P><Code>root@sakutkj:~# ls /var/www/web<N1/>index.html</Code></>"
	],

	"KonfigurasiNTPServer": [
		"<><P>Network Time Protocol (NTP) merupakan sebuah protocol yang bertugas untuk melakukan sinkronisasi waktu antar komputer dalam suatu jaringan.</P><P></P><P>Sehingga dapat kita simpulkan bahwa NTP Server adalah sebuah server yang bertugas untuk menyamakan waktu seluruh perangkat dalam jaringan baik itu komputer, router, access point, cctv, dan lain-lain. Hal ini sangat diperlukan dalam suatu jaringan untuk menghindari perbedaan waktu antar perangkat dalam jaringan. Berikut cara konfigurasi NTP Server pada Debian.</P><H2>1. Konfigurasi Waktu</H2><P>Sebelumnya kita harus mengatur waktu komputer kita dengan benar sebelum client menyamakan waktunya dengan komputer server kita.</P><P></P><P>Perintah berikut digunakan untuk melihat waktu pada Debian.</P><Code>root@sakutkj:/# date <N1/>Sat 29 May 2021 04:18:34 PM WIB</Code></>",
		"<><P>Pastikan waktu dan tanggal sudah benar. Contoh tampilan di atas sudah benar, tetapi jika kalian waktunya belum benar bisa diatur menggunakan perintah berikut.</P><P></P><P><B>Mengatur Tanggal</B></P><Code>root@sakutkj:/# date --set 2021-05-29 <N1/>Sat 29 May 2021 12:00:00 AM WIB</Code><P><B>Mengatur Jam</B></P><Code>root@sakutkj:/# date --set 16:21:00 <N1/>Sat 29 May 2021 04:21:00 PM WIB</Code><H2>2. Install Paket ntp</H2><Code>root@sakutkj:/# apt-get install ntp</Code><H2>3. Konfigurasi NTP Server</H2><P>Pada konfigurasi NTP Server kita perlu melakukan sedikit konfigurasi pada /etc/ntp.conf seperti berikut.</P></>",
		"<><Code>root@sakutkj:/# nano /etc/ntp.conf</Code><Code>---------------------------------------------- <N1/>---------------------------------------------- <N1/>---------------------------------------------- <N1/>#pool: {'\<\'}http://www.pool.ntp.org/join.html{'\>\'}<N1/>#pool 0.debian.pool.ntp.org iburst <N1/>#pool 1.debian.pool.ntp.org iburst <N1/>#pool 2.debian.pool.ntp.org iburst <N1/>#pool 3.debian.pool.ntp.org iburst <N1/>server 127.127.1.0 <N1/>fudge 127.127.1.0 stratum 1 <N1/>---------------------------------------------- <N1/>---------------------------------------------- <N1/>---------------------------------------------- <N1/># Clients from this (example!) subnet have unlimited access, but only if cryptographically authenticated. <N1/>#restrict 192.168.123.0 mask 255.255.255.0 notrust <N1/>restrict 192.168.1.0 mask 255.255.255.0 nomodify notrap</Code><P>Beri tanda (#) atau comment pada pool 0-3 kemudian tambahkan baris perintah baru seperti tampilan di atas.</P></>",
		"<><H2>4. Restart Service NTP</H2><Code>root@sakutkj:/# service ntp restart</Code><H2>5. Pengujian</H2><P>Cek menggunakan perintah berikut.</P><P></P><Img src={ntp1}/><P></P><P>Jika tampil seperti gambar di atas maka sudah berhasil konfigurasinya.</P><P></P><P>Lalu lakukan pengujian pada client. Contoh disini menggunakan client Windows.</P><P></P><Img src={ntp2}/></>",
	],

	"KonfigurasiDHCPServer": [
		"<><P>Dynamic Host Configuration Protocol (DHCP) adalah sebuah protocol yang berfungsi untuk memberikan IP Address secara dynamic (otomatis) kepada client.</P><P></P><P>Sehingga client yang terkoneksi ke server nantinya tidak perlu mengatur IP Address secara manual karena otomatis akan mendapat IP Address dari server.</P><P></P><P>Berikut cara konfigurasi DHCP Server pada Debian.</P><H2>1. Konfigurasi IP Address</H2><P>Pastikan komputer server sudah dikonfigurasi IP Address.</P><H2>2. Install Paket isc-dhcp-server</H2><Code>root@sakutkj:/# apt-get install isc-dhcp-server</Code></>",
		"<><H2>3. Konfigurasi DHCP Server</H2><P>Kita perlu mengedit beberapa konfigurasi pada file /etc/dhcp/dhcpd.conf seperti berikut ini.</P><Code>root@sakutkj:~# nano /etc/dhcp/dhcpd.conf</Code><P>Scroll ke bawah cari baris perintah seperti berikut ini.</P><Code>-------------------------------------------- <N1/>-------------------------------------------- <N1/># A slightly different configuration for an internal subnet. <N1/>#subnet 10.5.5.0 netmask 255.255.255.224 {'\{\'} <N1/># range 10.5.5.26 10.5.5.30; <N1/># option domain-name-servers ns1.internal.example.org; <N1/># option domain-name ''internal.example.org''; <N1/># option routers 10.5.5.1; <N1/># option broadcast-address 10.5.5.31; <N1/># default-lease-time 600; <N1/># max-lease-time 7200; <N1/>#{'\}\'} <N1/>-------------------------------------------- <N1/>--------------------------------------------</Code></>",
		"<><P>Lalu edit baris sebelumnya seperti contoh berikut ini.</P><Code>-------------------------------------------- <N1/>-------------------------------------------- <N1/># A slightly different configuration for an internal subnet. <N1/>subnet 192.168.1.0 netmask 255.255.255.0 {'\{\'} <N1/> range 192.168.1.2 192.168.1.100; <N1/> option domain-name-servers 192.168.1.1; <N1/> option domain-name ''sakutkj.me.id''; <N1/> option routers 192.168.1.1; <N1/> option broadcast-address 192.168.1.255; <N1/> default-lease-time 600; <N1/> max-lease-time 7200; <N1/>{'\}\'} <N1/>-------------------------------------------- <N1/>--------------------------------------------</Code></>",
		"<><P><B>Penjelasan:</B></P><P><B>- subnet & netmask</B> = Subnet dan Netmask yang dimiliki client</P><P><B>- range</B> = Range IP yang akan dibagikan ke client</P><P><B>- option domain-name-servers</B> = dns resolver yang dibagikan ke client</P><P><B>- option domain-name</B> = Penamaan host lokal</P><P><B>- option routers</B> = IP Gateway yang dibagikan ke client</P><P><B>- option broadcast</B> = IP Broadcast yang dibagikan ke client</P><P><B>- default-lease-time</B> = Lama waktu server meminjamkan IP kepada client</P><P><B>- max-lease-time</B> = waktu maksimal pemimjaman IP Address</P><H2>4. Restart Service DHCP</H2><Code>root@sakutkj:~# service isc-dhcp-server restart</Code><H2>5. Pengujian</H2><P>Berikut contoh pengujian dengan menggunakan client windows.</P><P></P><Img src={dhcp}/></>"
	]
}