{
    "FrontPanel": [
        "<><P>Sudah tahu apa itu front panel? Front panel adalah bagian-bagian yang terletak di depan atau atas casing komputer. Berupa tombol power, restart, USB Port dan Audio Port.<N1/></P><Img src={casing}/><P></P><P>Di casing komputer bagian belakang juga ada bahkan biasanya lebih banyak dan namanya adalah back panel.</P><P></P><P>Jadi bagian ini akan terhubung dengan pin front panel yang terdapat pada motherboad menggunakan kabel frontpanel. Untuk pemasangannya sendiri cukup mudah, biasanya pada pin yang terdapat pada motherboard akan ada keterangan seperti gambar berikut:</P><P></P><Img src={fpanel}/><P></P><P>Yang warna hijau adalah pin front panel audio, sedangkan biru adalah pin front panel USB dan hitam untuk pin front panel untuk tombol power, restart dan lampu led.</P></>",
        "<><P>Untuk pemasangan front panel audio dan USB cukup mudah karena kita hanya harus memasangkan kabel ke pin dengan posisi yang pas atau tidak terbalik. Beda dengan front yang warna hitam karena ada beberapa kabel. Lihat gambar berikut:</P><P></P><Img src={fpanel2}/><P></P><P>Gambar tersebut menunjukan cara pemasangan kabel front panel hitam sesuai dengan pin-nya. Sebenarnya di sekitar pin hitam biasanya terdapat keterangan untuk pemasangannya.</P><P></P><P>Pada umumnya front panel berupa seperti yang disebutkan di atas. Namun pesatnya perkembangan teknologi pastinya memungkinkan munculnya berbagai jenis motherboard yang nantinya front panel juga akan berbeda. Jadi jangan lupa baca buku panduan ketika membeli motherboard.</P><P></P></>",
				"<><H2>Referensi:</H2><P></P><C1>• https://www.youtube.com/watch?v=q16Y8uydYdU</C1><C1>• https://kabeliau.blogspot.com/2020/05/pengertian-dan-fungsi-kabel-front-panel.html</C1></>"
    ],

    "BunyiBIOS": [
    	"<><P>Bunyi beep BIOS adalah sebuah bunyi speaker yang dikeluarkan oleh komputer saat mendeteksi masalah pada proses <B>POST</B> (Power on Selft-Test).<N2/>Umumnya suara <I>beep</I> ini menandakan sebuah masalah yang sedang terjadi pada sistem komputer maupun masalah pada hardware.</P><P></P><P>Perlu diketahui, setiap BIOS memiliki kode beep yang berbeda-beda. Oleh karenanya, kamu harus mengetahui merk BIOS yang terpasang pada motherboard.<N2/>Cara cukup mudah, kamu bisa melihat merk BIOS ketika pertama kali menghidupkan komputer. Biasanya pada layar monitor tertera merk Motherboard dan juga Merk BIOS yang terpasang.</P></>",
    	"<><P>Berikut Arti Bunyi Beep Pada Komputer berdasarkan merk BIOS.</P><H2>Bunyi Beep Pada AMI BIOS</H2><Img src={ami}/><H2>Bunyi Beep Pada Award BIOS</H2><Img src={award}/><H2>Beep Pada Phoenix BIOS</H2><Img src={phoenix}/><H2>Beep Pada IBM BIOS</H2><Img src={ibm}/><P></P></>",
			"<><H2>Referensi:</H2><P></P><C1>• https://www.pintarkomputer.com/</C1></>"
    ],

    "KomponenDasarKomputer": [
		"<><P>Komputer secara fisik terdiri dari beberapa komponen yang merupakan suatu sistem. Jika salah satu komponen komputer tidak berfungsi, maka akan mengakibatkan komputer tidak berfungsi dengan baik. Komponen komputer ini berupa elemen-elemen perangkat keras (hardware).</P><P></P><P>Berdasarkan fungsinya, perangkat keras komputer dibagi menjadi <B>Perangkat Masukan</B>, <B>Perangkat Keluaran</B> dan <B>Perangkat Pemrosesan</B>.</P></>",
		"<><H2>1. Perangkat Masukan (Input Device)</H2><P>Perangkat masukan berfungsi untuk memasukkan data atau perintah ke dalam komputer.</P><H2>- Keyboard</H2><P>Keyboard merupakan perangkat input yang berfungsi memasukkan huruf, angka, karakter khusus dan beberapa fungsi tertentu ke dalam komputer.</P><Img src={pc1}/><H2>- Mouse</H2><P>Mouse merupakan perangkat input yang berfungsi untuk menggerakan kursor (pointer).</P><Img src={pc2}/><H2>- Touchpad</H2><P>Touchpad memiliki fungsi yang sama dengan mouse. Touchpad biasanya digunakan sebagai pengganti mouse pada laptop atau notebook.</P><Img src={pc3}/></>",
		"<><H2>- Microphone</H2><P>Microphone merupakan perangkat input yang berfungsi untuk merekam suara.</P><Img src={pc4}/><H2>- Webcam</H2><P>Webcam merupakan perangkat input yang berfungsi untuk mengambil gambar atau video.</P><Img src={pc5}/></><H2>- Scanner</H2><P>Scanner merupakan perangkat input yang berfungsi menyalin atau mengambil gambar dari data analog (kertas) menjadi data digital yang kemudian hasilnya ditampilkan pada komputer.</P><Img src={pc6}/><H2>- Barcode</H2><P>Barcode merupakan perangkat input yang berfungsi memindai barcode (kode garis-garis yang biasanya terdapat pada kemasan sebuah produk).</P><Img src={pc7}/>",
		"<><H2>- Joystick</H2><P>Joystick merupakan perangkat input yang digunakan untuk bermain game pada komputer.</P><Img src={pc8}/><H2>- Pemindai Sidik Jari (fingerprint)</H2><P>Fingerprint merupakan perangkat input yang berfungsi memindai sidik jari dan menampilkannya di komputer.</P><Img src={pc9}/></>",
		"<><H2>2. Perangkat Proses (Process Device)</H2><P>Perangkat proses berfungsi untuk memproses dan mengolah data yang diberikan oleh perangkat input yang kemudian di keluarkan dalam bentuk informasi melalui perangkat output.</P><H2>- Motherboard</H2><P>Motherboard merupakan salah satu perangkat dalam komputer yang digunakan sebagai tempat untuk memasang atau meletakan beberapa peralatan lain seperti: <N2/>Processor, memory, kabel-kabel data (penghubung) harddpisk, Flopy disk, Card (kartu) sepeti: VGA Card, NIC (kartu jaringan) dan lain sebagainya.</P><Img src={pc10}/><H2>- Processor</H2><P>Processor yaitu sebuah Chip yang merupakan otak pemroses dan pusat pengendali berbagai perangkat lain sehingga komputer dapat bekerja satu dengan lainya.</P><Img src={pc11}/></>",
		"<><H2>- RAM</H2><P>RAM adalah singkatan dari Random Access Memory, yaitu sebuah komponen komputer yang berfungsi untuk menyimpan data sementara dari suatu program yang sedang kita jalankan dan data-data tersebut bisa diakses secara acak atau random.</P><Img src={pc12}/><H2>- VGA Card</H2><P>VGA Card adalah komponen komputer yang berfungsi untuk mengolah data graphis dan ditampilkan di layar monitor.</P><Img src={pc13}/><H2>- Sound Card</H2><P>Sound Card memiliki fungsi sebagai pengolah data berupa audio atau suara dan sebagai penghubung alat input/output suara ke komputer.</P><Img src={pc14}/></>",
		"<><H2>3. Perangkat Keluaran (Output Device)</H2><P>Perangkat keluaran berfungsi untuk menampilkan data, instruksi, dan informasi dalam bentuk teks dan grafik atau gambar.</P><H2>- Monitor</H2><P>Monitor berfungsi untuk menampilkan data, instruksi dan informasi dalam bentuk teks dan grafik atau gambar di layar monitor.</P><Img src={pc15}/><H2>- Speaker</H2><P>Speaker memiliki fungsi untuk menghasilkan atau mengeluarkan efek suara dari komputer.</P><Img src={pc16}/><H2>- Printer</H2><P>Printer yaitu peralatan keluaran yang digunakan untuk mencetak data/informasi dari komputer dengan kertas.</P><Img src={pc17}/></>",
		"<><H2>- Proyektor</H2><P>Proyektor adalah perangkat yang digunakan untuk menampilkan gambar yang dihasilkan oleh komputer atau pemutar Blu-ray.<N2/>Gambar tersebut kemudian ditampilkan pada permukaan datar di depannya, seperti layar atau dinding.</P><Img src={pc18}/><H2>- Headset</H2><P>Headset adalah perangkat yang terhubung pada komputer atau telepon genggam.</P><Img src={pc19}/></>",
		"<><H2>Referensi:</H2><P></P><C1>• https://www.yuksinau.id/perangkat-keras-komputer/#3_Monitor</C1><C1>• https://www.nesabamedia.com/</C1><C1>• https://www.nusakomputer.com</C1><C1>• http://blog.unnes.ac.id/sutrisno/2017/03/08/10-macam-input-device-perangkat-masukan-komputer/</C1><C1>• http://blog.unnes.ac.id/sutrisno/2017/03/08/contoh-perangkat-proses-komputer-dan-berserta-gambarnya/</C1><C1>• https://sovira12.wordpress.com/2010/08/24/komponen-dasar-komputer-dan-fungsinya/</C1><C1>• https://www.baktikominfo.id/id/informasi/pengetahuan/10_macam_perangkat_output_komputer_beserta_fungsinya-655</C1></>"
    ],

	"UrutanKabelUTP": [
		"<><P>Dalam pemasangan kabel UTP terdapat dua jenis pemasangan kabel yang sering digunakan dalam jaringan internet, yaitu <B>Straight Through Cable</B> dan <B>Cross Over Cable</B>.<N2/>Beda di antara keduanya hanya pada urutan warna pemasangan kabel pada konektor (Biasanya berupa konektor RJ-45).</P></>",
		"<><H2>Kabel Straight</H2><P>Sesuai namanya <B>straight</B> berarti <B>lurus</B>. Jadi kabel straight merupakan jenis kabel yang memiliki cara pemasangan(urutan warna kabel) yang sama antara ujung satu dengan ujung lainnya. Urutannya yaitu:</P><Img src={str}/><P></P><P>Cara mudah menghafalnya kita buat kata-kata menjadi:</P><P></P><P><B>Penampilan Ondel-Ondel Pak Haidar Bikin Para Bapak Haji Punya Cerita Cinta</B>. Lalu, setiap huruf depan itu mewakili nama warna. Menjadi <B>PO-O-PH-B-PB-H-PC-C</B>.<N2/><B>PO</B> maksudnya <I>Putih Orange</I> sedangakan <B>O</B> maksudnya <I>Orange</I> dan seterusnya. Fungsi kabel straight ini biasanya digunakan untuk pemasangan device yang berbeda. Kabel tipe straight ini paling banyak digunakan sampai saat ini karena fungsinya.</P></>",
		"<><H2>Kabel Crossover</H2><P>Kabel Crossover merupakan kabel dengan susunan warna yang berbeda setiap ujungnya. Fungsi kabel Crossover ini digunakan untuk menghubungkan device yang sama.</P><P></P><P>Kabel ini mempunyai susunan yang berbeda pada kedua ujungnya. Ujung yang pertama menggunakan urutan yang sama seperti kabel staright sedangkan ujung lainnya menggunakan urutan <B>PH-H-PO-B-PB-O-PC-C.</B></P><Img src={cross}/><P></P><P>Cara menghafal yang mudah pada ujung kedua ini, cukup menukar kabel nomor 1 dengan 3 dan 2 dengan 6.</P></>",
		"<><H2>Referensi:</H2><P></P><C1>• https://qwords.com/</C1></>"
	],

	"JenisKabelJaringan": [
		"<><P>Pada awalnya jaringan LAN (Local Area Network) menggunakan kabel <B>coaxial</B>. Kemudian, kabel <B>twisted pair</B> yang digunakan dalam sistem telepon telah mampu membawa frekuensi yang lebih tinggi dan dapat mendukung trafik LAN.<N2/>Saat ini, kabel <B>fiber optik</B> telah tampil sebagai pilihan kabel berkecepatan sangat tinggi. Kabel-kabel tersebut merupakan jenis kabel yang pernah dan saat ini digunakan dalam dunia jaringan.</P></>",
		"<><H2>1. Kabel Coaxial</H2><Img src={coax}/><P></P><P>Jenis kabel jaringan yang pertama adalah coaxial. Kabel coaxial adalah kabel jaringan yang terdiri dari 2 lapisan konduktor.<N2/>Lapisan pertama posisinya berada pada bagian tengah berupa kawat tembaga padat dengan dibungkus lapisan isolator.<N2/>Lapisan kedua berada diatas lapisan isolator berbahan metal biasa disebut metal shielded yang fungsinya untuk mencegah gangguan dari luar.</P></>",
		"<><P>Prinsip kerja kabel coaxial adalah dengan menghantarkan sinyal listrik dari sumber ke tujuan. Kabel ini bisa dipakai untuk menghubungkan antar perangkat komputer.<N2/>Dalam penggunaan kabel coaxial ini sering digunakan untuk penggunaan jaringan dengan bandwidth yang tinggi karena lebih aman dari segala gangguan.</P><P></P><P>Saat ini kabel coaxial sudah mulai banyak ditinggalkan oleh penggunanya karena port BNC pada perangkat komputer dan jaringan sudah jarang ditemui.<N2/>Ini karena untuk pemasangan kabel coaxial membutuhkan keahlian yang khusus, tidak semudah memasang konektor jenis kabel lainnya.</P></>",
		"<><P><B>Kelebihan kabel coaxial</B></P><P>• Harganya lebih murah dibandingkan dengan jenis kabel jaringan lain</P><P>• Jangkauan kecepatan dan transmisi data lebih cepat</P><P>• Resiko kehilangan sinyal rendah</P><P>• Masa penggunaan yang lebih panjang</P><N1/><P><B>Kekurangan kabel coaxial</B></P><P>• Memiliki batasan jangkauan panjang maksimal</P><P>• Kabel rentan pada faktor cuaca, suhu dan beban</P><P>• Pemasangan konektor BNC tergolong susah</P><P>• Walaupun kabelnya murah tapi untuk biaya perawatan tinggi</P><P>• Membutuhkan repeater tambahan</P></>",
		"<><H2>2. Kabel Twisted Pair</H2><Img src={utp}/><P></P><P>Jenis kabel jaringan kedua adalah twisted pair. Kabel twisted pair adalah kabel jaringan yang di dalamnya terdiri dari beberapa kabel saling berpasangan jumlahnya ada 8 kabel dengan warna yang berbeda.<N2/>Untuk cara kerja kabel twisted pair sama dengan kabel coaxial yaitu dengan menghantarkan arus listrik. Pada lapisan dalam kabel twisted pair terdapat kawat tembaga yang berfungsi sebagai konduktor.</P></>",
		"<><P>Ada 3 jenis kabel twisted pair yang perlu Anda tahu:</P><H2>• UTP (Unshielded Twisted Pair)</H2><P>Kabel UTP adalah jenis kabel twisted pair tanpa pelindung bagian dalam kabel. Jenis kabel ini paling banyak digunakan saat ini karena memiliki fungsi yang sama tetapi harganya lebih murah dibandingkan dengan jenis twisted pair lain.</P><H2>• FTP (Foiled Twisted Pair)</H2><P>FTP adalah jenis kabel yang dengan pelindung alumunium foil pada bagian luar pair kabel sehingga lebih tahan dari interferensi gelombang elektromagnetik. Kabel FTP ini menjadi pilihan paling bagus daripada kabel UTP tetapi untuk harganya lebih mahal.</P><H2>• STP (Shielded Twisted Pair)</H2><P>Kabel STP adalah jenis kabel twisted pair yang memiliki lapisan alumunium foil sebagai pelindung pada bagian dalam kabel yang berfungsi untuk menghalau gangguan elektromagnetik yang mempengaruhi internet. Alumunium foil pada kabel STP membungkus setiap pasang kabel tembaga, jadi akan ada 4 shielded pair aluminium dalam kabel.</P></>",
		"<><P>Dalam memilih kabel twisted pair, kadang setiap kabel memiliki label <B>CAT5/CAT5e</B> dan <B>CAT6</B>.<N1/>Label tersebut merupakan kode yang menandakan kemampuan transfer data setiap kabel.<N2/>Untuk kabel <B>CAT5/CAT5e</B> adalah teknologi kabel lama yang sudah ada sejak tahun 2001. Kabel versi ini mampu mentransmisikan data 100 Mbit/second dengan speed maksimal 250 MHz.<N2/>Kabel versi CAT6 adalah versi canggihnya yaitu bisa mentransmisikan data hingga 10 Gbit/second dengan panjang kabel maksimal bisa mencapai 100 meter. Namun, selepas dari berbagai kelebihan tentunya kabel STP juga punya beberapa kekurangan, yaitu:</P><P></P><P>• Atenuasi meningkat pada frekuensi tinggi. </P><P>• Pada frekuensi tinggi, keseimbangan menurun sehingga tidak dapat mengkompensasi timbulnya <B>crosstalk</B> dan sinyal <B>noise</B>. </P><P>• Harganya cukup mahal</P></>",
		"<><H2>3. Kabel Fiber Optik</H2><Img src={fiber}/><H2>Kelebihan Fiber Optik</H2><P>• Transmisi data dengan kecepatan yang tinggi</P><P>• Bandwidth yang besar hingga Gigabit</P><P>• Jangkauan wilayahnya yang luas</P><P>• Kabel lebih awet dari gangguan alam yang ekstrem</P><P>• Biaya perawatan yang murah</P><P>• Mampu menahan gangguan elektromagnetik</P><P>• Fitur keamanan yang kuat</P><H2>Kekurangan Fiber Optik</H2><P>• Harganya paling mahal dibandingkan jenis kabel lainnya</P><P>• Proses instalasi yang rumit</P><P>• Butuh investasi yang besar saat pemasangan</P><P>• Tidak sembarang teknisi bisa memperbaiki saat terjadi kerusakan</P></>",
		"<><P>Selepas semua itu, sudah paham bedanya bit, Megabit(Mb) dan Gigabit(Gb)?</P><P></P><P>Singkatnya itu merupakan satuan data digital. Jika di kehidupan nyata kita sering dengar istilah kilogram, gram untuk satuan massa dan meter, inci, kilometer untuk satuan panjang. <N2/>Nah bit, megabit, gigabit adalah satuan data digital. Hati-hati <B>b</B> (huruf non-kapital) berbeda dengan <B>B</B> (huruf kapital). ''b'' merupakan kependekan dari <B>bit</B> sedangkan B kependekan dari <B>Byte</B>.</P><P></P><P>1 Kilobit (Kb) = 1000 bit <N1/>1 Megabit (Mb) = 1000 Kb <N1/>1 Gigabit (Gb) = 1000 Mb <N1/>1 Byte (B) = 8 bit (b) <N1/>1 KiloByte (KB) = 1024 byte <N1/>1 MegaByte (MB) = 1024 KB = 1048576 Byte <N1/>1 GigaByte (GB) = 1024 MB = 1073741824 Byte</P></>",
		"<><H2>Referensi:</H2><C1>• https://www.it-jurnal.com/</C1><C1>• https://blog.webiptek.com/</C1><C1>• https://catatanshand.blogspot.com/</C1><C1>• https://rifqipriyadi26.blogspot.com/</C1><C1>• https://erlanggaputraa.blogspot.com/</C1></>"
	]
}
